Revit 2020 API
Gradient Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class Gradient
Visual Basic
Public NotInheritable Class Gradient
Visual C++
public ref class Gradient abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Gradient
See Also
Gradient Members
Autodesk.Revit.DB.Visual Namespace